In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
train=pd.read_csv("C:\\Users\\Asus\\Downloads\\Dataset\\Dataset\\Train.csv")

In [3]:
train.head()

,Monthly_Output_Tonnes,Yearly_Release_Count,CO2_Emissions,Water_Used_ML,Waste_To_Landfill_Tonnes,Avg_Worker_Wage_USD,Weekly_Work_Hours,Avg_fashion_item_Price
0,588.648594,17,11594.85374,191.264884,930.946232,86.021109,63,22.459343
1,419.410744,16,17049.04268,233.167384,802.147084,162.032022,56,16.283957
2,523.379827,7,7916.67980,212.169477,918.327579,42.024435,52,18.570310
3,202.911362,29,14981.41434,177.040708,903.096798,153.365509,51,14.158061
4,185.040996,15,12495.97073,153.809215,767.246025,125.304830,48,22.631940

In [4]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15000 entries, 0 to 14999
Data columns (total 8 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Monthly_Output_Tonnes     15000 non-null  float64
 1   Yearly_Release_Count      15000 non-null  int64
 2   CO2_Emissions             15000 non-null  float64
 3   Water_Used_ML             15000 non-null  float64
 4   Waste_To_Landfill_Tonnes  15000 non-null  float64
 5   Avg_Worker_Wage_USD       15000 non-null  float64
 6   Weekly_Work_Hours         15000 non-null  int64
 7   Avg_fashion_item_Price    15000 non-null  float64
dtypes: float64(6), int64(2)
memory usage: 937.6 KB

In [5]:
train.describe()

,Monthly_Output_Tonnes,Yearly_Release_Count,CO2_Emissions,Water_Used_ML,Waste_To_Landfill_Tonnes,Avg_Worker_Wage_USD,Weekly_Work_Hours,Avg_fashion_item_Price
count,15000.000000,15000.000000,15000.000000,15000.000000,15000.000000,15000.000000,15000.000000,15000.000000
mean,495.672919,17.745933,10053.561736,201.741882,794.302712,149.477809,54.946867,19.915037
std,150.752883,6.914557,3040.365680,60.412129,203.926013,49.646791,8.505022,5.797920
min,-17.848056,6.000000,-24.825368,6.221189,34.379810,-58.387487,40.000000,0.573808
25%,397.721632,12.000000,7906.450178,161.430231,653.867888,116.948153,48.000000,15.568214
50%,494.346126,18.000000,10075.385745,200.552146,797.548515,148.996408,55.000000,19.861666
75%,593.578755,24.000000,12146.526870,241.195713,932.165950,183.183866,62.000000,24.195608
max,1016.881177,29.000000,19996.749680,370.353479,1492.483236,329.532965,69.000000,36.797473

In [4]:
X=train.drop("Avg_fashion_item_Price", axis=1)
y=train['Avg_fashion_item_Price']

In [9]:
X

,Monthly_Output_Tonnes,Yearly_Release_Count,CO2_Emissions,Water_Used_ML,Waste_To_Landfill_Tonnes,Avg_Worker_Wage_USD,Weekly_Work_Hours
0,588.648594,17,11594.853740,191.264884,930.946232,86.021109,63
1,419.410744,16,17049.042680,233.167384,802.147084,162.032022,56
2,523.379827,7,7916.679800,212.169477,918.327579,42.024435,52
3,202.911362,29,14981.414340,177.040708,903.096798,153.365509,51
4,185.040996,15,12495.970730,153.809215,767.246025,125.304830,48
...,...,...,...,...,...,...,...
14995,445.328948,12,9649.409425,208.321185,687.907964,87.729158,67
14996,291.084257,27,7936.741727,159.693766,360.529936,195.873001,53
14997,682.726044,27,12695.623350,139.610304,648.653926,113.215317,62
14998,500.365771,19,11203.538040,149.473962,966.047571,211.141058,61
14999,313.633643,18,12645.815800,208.433740,739.403223,189.822136,60

## Split the Data

In [5]:
from sklearn.model_selection import train_test_split

In [6]:
X_train, X_test, y_train, y_test = train_test_split(
    X, y, test_size=0.2, random_state=42
)

In [7]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()
X_train_scaled = scaler.fit_transform(X_train)
X_test_scaled = scaler.transform(X_test)

In [8]:
from sklearn.ensemble import RandomForestRegressor
from xgboost import XGBRegressor

In [9]:
models = {
    "RandomForest": RandomForestRegressor(random_state=42),
    "XGBoost": XGBRegressor(random_state=42, verbosity=0),
}

### Evaluate with Cross-Validation

In [21]:
from sklearn.model_selection import cross_val_score
from sklearn.metrics import r2_score, mean_squared_error,mean_absolute_error

for name, model in models.items():
    scores = cross_val_score(model, X_train_scaled, y_train, cv=5, scoring='r2')
    print(f"{name} CV R2: {scores.mean():.4f}")

RandomForest CV R2: 0.9552
XGBoost CV R2: 0.8700

### Hyperparameter Tuning

In [12]:
from sklearn.model_selection import RandomizedSearchCV

param_grid_rf = {
    'n_estimators': [100, 200, 300,350],
    'max_depth': [None, 5, 10],
    'min_samples_split': [2, 5],
}

search_rf = RandomizedSearchCV(RandomForestRegressor(random_state=42), param_grid_rf, 
                                scoring='r2', random_state=42)
search_rf.fit(X_train_scaled, y_train)

best_rf = search_rf.best_estimator_

In [13]:
best_rf

RandomForestRegressor(n_estimators=200, random_state=42)

In [147]:
rfr=RandomForestRegressor(n_estimators=275)

In [148]:
rfr.fit(X_train_scaled, y_train)

RandomForestRegressor(n_estimators=275)

In [149]:
y_preds=rfr.predict(X_test_scaled)

In [150]:

print("R2 Score:", r2_score(y_test, y_preds))
print("MSE:", mean_squared_error(y_test, y_preds))

R2 Score: 0.970939791672217
MSE: 0.9931763118875246

In [114]:
print("R2 Score:", r2_score(y_test, y_preds))
print("MSE:", mean_squared_error(y_test, y_preds))

R2 Score: 0.9711823631588739
MSE: 0.9848860666226091

###  Final Evaluation on Test Set

In [16]:
y_pred = best_rf.predict(X_test_scaled)

print("R2 Score:", r2_score(y_test, y_pred))
print("MSE:", mean_squared_error(y_test, y_pred))

R2 Score: 0.96918860004622
MSE: 1.0530259186383892

In [44]:
test_df=pd.read_csv("C:\\Users\\Asus\\Downloads\\Dataset\\Dataset\\Test.csv")

In [25]:
test_df.head()

,Monthly_Output_Tonnes,Yearly_Release_Count,CO2_Emissions,Water_Used_ML,Waste_To_Landfill_Tonnes,Avg_Worker_Wage_USD,Weekly_Work_Hours,Avg_fashion_item_Price
0,416.427313,26,12973.10315,205.068617,981.194258,134.407898,57,NaN
1,535.856742,8,10250.78653,190.365786,1024.857400,214.419836,41,NaN
2,196.137250,16,11754.92941,182.129182,696.759239,217.551386,55,NaN
3,418.432238,17,7902.26642,167.511985,617.092388,126.183107,48,NaN
4,496.369544,29,11866.33608,208.675372,795.154610,199.458920,65,NaN

In [45]:
test_df=test_df.drop('Avg_fashion_item_Price',axis=1)

In [22]:
test_df.head()

,Monthly_Output_Tonnes,Yearly_Release_Count,CO2_Emissions,Water_Used_ML,Waste_To_Landfill_Tonnes,Avg_Worker_Wage_USD,Weekly_Work_Hours
0,416.427313,26,12973.10315,205.068617,981.194258,134.407898,57
1,535.856742,8,10250.78653,190.365786,1024.857400,214.419836,41
2,196.137250,16,11754.92941,182.129182,696.759239,217.551386,55
3,418.432238,17,7902.26642,167.511985,617.092388,126.183107,48
4,496.369544,29,11866.33608,208.675372,795.154610,199.458920,65

In [63]:
test_final = scaler.transform(test_df)  # use the fitted scaler from training

In [96]:
predictions=rfr.predict(test_final)

In [97]:
result=pd.DataFrame(predictions,columns=['Avg_fashion_item_Price'])

In [98]:
result

     Avg_fashion_item_Price
0                 15.722769
1                 27.396531
2                 21.823555
3                 12.578752
4                 29.544902
..                      ...
195               13.566376
196               18.635015
197               17.546487
198               26.638392
199               17.155331

[200 rows x 1 columns]

In [99]:
result.to_csv("C:\\Users\\Asus\\Downloads\\submission.csv", index=False)